C ল্যাঙ্গুয়েজে Statement (স্টেটমেন্ট) হলো কোডের একেকটি একক বা নির্দেশ (Instruction)। সি ল্যাঙ্গুয়েজে কম্পিউটারকে কাজ করানোর জন্য যে একেকটি লাইন বা কমান্ড লিখা হয়, তার প্রত্যেকটিকে একেকটি স্টেটমেন্ট বলা হয়।
সেমিকোলন (;) দিয়ে একটি "Simple Statement" বা সাধারণ স্টেটমেন্ট শেষ হয়। কিন্তু সি-তে এমন অনেক স্টেটমেন্ট আছে যেগুলোর শেষে সেমিকোলন লাগে না।

সেমিকোলন যুক্ত স্টেটমেন্ট (Expression Statements)
সি কম্পাইলারকে যখন সুনির্দিষ্ট কোনো নির্দেশ দেওয়া হয় এবং তার শেষে সেমিকোলন (;) বসাই, তখন কম্পাইলার বোঝে যে ওই নির্দেশের কাজ এখানেই শেষ (যেমন ইংরেজি বাক্যের শেষে Full Stop থাকে)।

int x = 10;            // ডিক্লেয়ারেশন স্টেটমেন্ট
x = x + 5;             // অ্যাসাইনমেন্ট স্টেটমেন্ট
printf("Hello World"); // ফাংশন কল স্টেটমেন্ট

এখানে প্রতিটা লাইনই একেকটি স্টেটমেন্ট এবং এগুলো সেমিকোলন দিয়ে শেষ হয়েছে।


সেমিকোলন ছাড়া স্টেটমেন্ট (Compound / Control Statements)

সি-তে এমন কিছু স্টেটমেন্ট আছে যা একাধিক লাইন জুড়ে থাকে কিংবা কোনো শর্ত নিয়ন্ত্রণ করে। এগুলোর শেষে সেমিকোলন দিতে হয় না।

Compound Statement (ব্লক): দ্বিতীয় বন্ধনী বা কার্লি ব্র্যাকেটের { } ভেতরের অংশকে একসাথে একটি স্টেটমেন্ট ধরা হয়। এর শেষে সেমিকোলন লাগে না।

Control Statements: যেমন if-else বা লুপ (for, while)।

if (x > 5) {
    printf("Big");
} // এই পুরো 'if' ব্লকটি নিজেই একটি স্টেটমেন্ট, কিন্তু এর শেষে কোনো সেমিকোলন নেই!



কম্পাইলারকে দেওয়া যেকোনো সম্পূর্ণ নির্দেশ, যা কম্পিউটার কোনো একটি কাজ সম্পন্ন করার জন্য এক্সিকিউট (Run) করতে পারে, তাকেই স্টেটমেন্ট বলে।

যদি নির্দেশটি এক লাইনের সাধারণ নির্দেশ হয়, তবে তা শেষ করতে ; (Semicolon) লাগে।

যদি নির্দেশটি কোনো কন্ডিশন, লুপ বা কোডের ব্লক হয়, তবে তা শেষ করতে সেমিকোলন লাগে না।

while লুপের শেষে সেমিকোলন লাগে না, কিন্তু do-while লুপের শেষে আবার বাধ্যতামূলক সেমিকোলন (;) দিতে হয়!



#include <stdio.h>
int main()
{
    // 1. variable statement
    int age = 20;

    // 2. assignment statement
    a = 10;
    b = 20;

    //3. Function Call Statement
    printf("Hello world!\n");

    // 4. Expression Statement
    sum = a + b;

    //5. Conditional Statement
    if (age > 18) {
    printf("Adult");
}
    //6. return statement
    return 0;
}
