Logical Operatorsঃ

সি (C) প্রোগ্রামিং ল্যাঙ্গুয়েজে লজিক্যাল অপারেটর (Logical Operators) ব্যবহার করা হয় একাধিক শর্ত (conditions) একসাথে যাচাই করতে এবং সেগুলোর ওপর ভিত্তি করে সিদ্ধান্ত নিতে

সি প্রোগ্রামিংয়ে প্রধানত তিনটি লজিক্যাল অপারেটর রয়েছেঃ

Logical AND (&&)

যখন দুটি শর্তই সত্য (true) হতে হয়, তখন এই অপারেটর ব্যবহার করা হয়। এটি তখনই True (1) রিটার্ন করে যখন সবগুলো শর্তই সত্য হয়। যদি একটি শর্তও ভুল হয়, তবে ফলাফল False (0) হবে।

 যদি উভয় শর্তই সত্য হয়, তবেই ফলাফল সত্য হবে। যেকোনো একটি শর্ত মিথ্যা হলে পুরো ফলাফল মিথ্যা হয়ে যাবে।

True && True = 1 (True)

True && False = 0 (False)

False && False = 0 (False)


Logical OR (||)

এই অপারেটরটি সত্য (True) ফলাফল দেয় যদি অন্তত যেকোনো একটি শর্ত সত্য হয় [১০]। উভয় শর্ত মিথ্যা হলেই কেবল এটি মিথ্যা ফলাফল দেয়
এটি তখনই True (1) রিটার্ন করে যখন যেকোনো একটি শর্ত সত্য হয়। শুধুমাত্র সব শর্ত ভুল হলেই ফলাফল False (0) হয়।

True || False = 1 (True)

False || True = 1 (True)

False || False = 0 (False)


(!) - Logical NOT

এটি একটি ইউনিটারি অপারেটর যা শর্তের মান উল্টে দেয় অর্থাৎ, শর্ত সত্য হলে তাকে মিথ্যা করে, আর মিথ্যা হলে সত্য করে।
!(5 == 5) -> ফলাফল আসবে 0 (কারণ ৫ তো ৫ এর সমান, কিন্তু NOT সেটাকে উল্টে দিয়েছে)।
